# Create & Access SQLite database using Python

In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect("INSTRUCTOR.DB")

In [5]:
#CURSOR OBJECT
cursor_obj = conn.cursor()

BEFOR CREATING A TABLE WE DROP THE EXIST TABLES TO DROP THE TABLE IN DATABASE WE USE DROP QUEERY..

A CURSOR IS AN OBJECT THAT HELPS EXCUTE THE QUERY AND FETCH THE RECORDS FROM THE DATABASE

In [7]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

# CREATE THE TABLE

In [8]:
Table = """CREATE TABLE IF NOT EXISTS INSTRUCTOR (ID INTEGER PRIMARYKEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""

In [9]:
cursor_obj.execute(Table)

In [10]:
print("table is ready")

table is ready

# insert the data to the table

In this step we will insert some rows of data into the table.

In [11]:
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

Query data in the table

In [16]:
statement = """SELECT * FROM  INSTRUCTOR"""

cursor_obj.execute(statement)

print("all the data ")
output_all= cursor_obj.fetchall()
for raw_all in output_all: 
    print(raw_all)

all the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')

In [19]:
statement = '''SELECT FNAME FROM INSTRUCTOR'''

cursor_obj.execute(statement)
print("Some of the raws")

output_some = cursor_obj.fetchmany(2)
for raw in output_some: 
    print(raw)

Some of the raws
('Rav',)

UPDATE THE CITY FROM TOROTO TO MOONCITY WHERE THE NAME IS RAV

In [26]:
update_query = '''UPDATE INSTRUCTOR SET CITY ='MOONCITY' WHERE FNAME ="Rav" '''
cursor_obj.execute(update_query)

In [27]:
statement = '''SELECT * FROM INSTRUCTOR '''
cursor_obj.execute(statement)

print('all the data ')
output_all = cursor_obj.fetchall()
for data in output_all:
    print(data)

all the data
(1, 'Rav', 'Ahuja', 'MOONCITY', 'CA')

Retrieve data into panadas

In [28]:
!pip install panadas

import pandas as pd

Collecting panadas
  Downloading panadas-0.2-py3-none-any.whl (4.9 kB)
Installing collected packages: panadas
Successfully installed panadas-0.2

In [31]:
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("SELECT * FROM INSTRUCTOR",conn)
df

   ID FNAME  LNAME      CITY CCODE
0   1   Rav  Ahuja  MOONCITY    CA

In [34]:
df.shape

(1, 5)

In [35]:
#print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Ahuja'

close the connection